


Netext Working Group                                    F. Abinader, Ed.
Internet-Draft                             Instituto Nokia de Tecnologia
Intended status: Standards Track                      S. Gundavelli, Ed.
Expires: April 1, 2012                                          K. Leung
                                                                   Cisco
                                                             S. Krishnan
                                                                Ericsson
                                                               D. Premec
                                                            Unaffiliated
                                                      September 29, 2011


           Bulk Re-registration Support for Proxy Mobile IPv6
               draft-ietf-netext-bulk-re-registration-05

Abstract

   For extending the lifetime of a mobility session, the Proxy Mobile
   IPv6 specification requires the mobile access gateway to send a Proxy
   Binding Update message to the local mobility agent on a per-session
   basis.  In the absence of signaling semantics for performing
   operations with group specific scope, it results in significant
   amount of signaling traffic on a periodic basis between a given
   mobile access gateway and a local mobility anchor.  This document
   defines an optimization to the binding update and revocation
   operations in Proxy Mobile IPv6 for performing operations with group
   specific scope with the use of a group identifier.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 1, 2012.

Copyright Notice

   Copyright (c) 2011 IETF Trust and the persons identified as the



Abinader, et al.          Expires April 1, 2012                 [Page 1]

Internet-Draft            Bulk Re-registration            September 2011


   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Conventions & Terminology  . . . . . . . . . . . . . . . . . .  4
     2.1.  Conventions  . . . . . . . . . . . . . . . . . . . . . . .  4
     2.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  Bulk Binding Update Overview . . . . . . . . . . . . . . . . .  4
     3.1.  Motivation . . . . . . . . . . . . . . . . . . . . . . . .  4
     3.2.  General Operation  . . . . . . . . . . . . . . . . . . . .  5
   4.  Message formats  . . . . . . . . . . . . . . . . . . . . . . .  6
     4.1.  Extensions to Proxy Binding Update Message . . . . . . . .  7
     4.2.  Extensions to Proxy Binding Acknowledgment Message . . . .  8
     4.3.  Mobile Node Group Identifier Option  . . . . . . . . . . .  8
     4.4.  Status Codes . . . . . . . . . . . . . . . . . . . . . . .  9
   5.  Protocol Considerations  . . . . . . . . . . . . . . . . . . .  9
     5.1.  MAG Considerations . . . . . . . . . . . . . . . . . . . . 10
       5.1.1.  Requesting a Bulk Binding Update Group Identifier  . . 10
       5.1.2.  Sending a Bulk Binding Update Operation Request  . . . 11
     5.2.  LMA Considerations . . . . . . . . . . . . . . . . . . . . 11
       5.2.1.  Assigning a Bulk Binding Update Group Identifier . . . 12
       5.2.2.  Handling a Bulk Binding Update Request . . . . . . . . 13
   6.  Protocol Configuration Variables . . . . . . . . . . . . . . . 15
     6.1.  Local Mobility Anchor - Configuration Variables  . . . . . 15
     6.2.  Mobile Access Gateway - Configuration Variables  . . . . . 16
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 16
   8.  Security Considerations  . . . . . . . . . . . . . . . . . . . 17
   9.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 17
   10. Normative References . . . . . . . . . . . . . . . . . . . . . 17
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 18









Abinader, et al.          Expires April 1, 2012                 [Page 2]

Internet-Draft            Bulk Re-registration            September 2011


1.  Introduction

   The Proxy Mobile IPv6 base specification [RFC5213] requires the
   Mobile Node Identifier option to be present in the mobility signaling
   messages, such as in the Proxy Binding Update and Proxy Binding
   Acknowledgement messages.  It essentially limits the operational
   scope of the signaling messages to a single mobility session.  These
   signaling messages lack the capability to identify a group of
   mobility sessions which have a common characteristic so to perform
   operations on the entire group.

   There is a need to have semantics for defining a group affiliation
   for a mobility session, so some of relevant protocol operations can
   be performed on the entire group.  The use of a group identifier in
   protocol operations can extend the scope of the operation to the
   entire group.  The group identifier therefore provides a more optimal
   mechanism for protocol operations which would otherwise require
   multiple atomic transactions on a per mobile node basis.  Following
   are some of the use-cases where the group identifier can be used.

   o  For extending the lifetime of all the mobility sessions that are
      part of a group, the mobile access gateway can potentially send a
      single Proxy Binding Update message to the local mobility anchor,
      by including a group identifier that identifies all the mobility
      sessions that are part of that group.  The local mobility anchor
      upon accepting the request can update the lifetime of all the
      mobility sessions that are part of that group.

   o  In a blade architecture system running the local mobility anchor
      service, all the mobile node sessions anchored on a given card can
      belong to a single group.  When a failure occurs on a specific
      card, the local mobility anchor can initiate the revocation
      signaling to the mobile access gateway by sending a single
      revocation request carrying the group identifier.

   o  The mobile access gateway, or the local mobility anchor can choose
      to revoke all the mobility sessions belonging to a specific group.
      In such cases the mobile access gateway or the local mobility
      anchor can perform the binding revocation signaling using the
      group identifier associated with a specific set of mobile nodes.

   The document defines a new mobility option, Mobile Node Group
   Identifier option, which can be used in binding update and binding
   revocation related operations, for performing operations with group
   specific scope.






Abinader, et al.          Expires April 1, 2012                 [Page 3]

Internet-Draft            Bulk Re-registration            September 2011


2.  Conventions & Terminology

2.1.  Conventions

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

2.2.  Terminology

   All the mobility related terms used in this document are to be
   interpreted as defined in the base Proxy Mobile IPv6 specifications
   [RFC5213] and [RFC5844].  Additionally, this document uses the
   following abbreviations:

   Group Identifier

      An opaque identifier that identifies a set of mobile nodes
      mobility sessions, that are part of a common logical group.  This
      identifier is generated by the local mobility anchor and will be
      unique to each group.  The specifics on how a given local mobility
      anchor groups different mobility sessions is out side the scope of
      this document.

   Bulk Binding Update

      A binding update operation that has group specific scope.  A
      binding operation is associated with a specific mobility session.
      However, a Bulk binding update operation is associated with
      multiple mobility sessions.  This operation is not relevant for
      new mobility session creations.

   Bulk Binding Update Group

      A group of mobility sessions that are part of the same logical
      group and therefore share a common group identifier.


3.  Bulk Binding Update Overview

3.1.  Motivation

   In a Proxy Mobile IPv6 domain a local mobility anchor serves multiple
   mobile access gateways and the capacity of that node with respect to
   the number of mobility sessions it can host is quite high.  It is
   typically in the order of few million sessions.  As the number of
   mobility sessions that the local mobility anchor hosts goes up, so
   will be the amount of signaling traffic related to periodic binding



Abinader, et al.          Expires April 1, 2012                 [Page 4]

Internet-Draft            Bulk Re-registration            September 2011


   update related traffic.  The following simple formula gives an
   estimate of the average number of binding update related transactions
   per second as a function of the number of registered mobility
   sessions and the binding lifetime

   Transactions/sec = (Number of hosted mobility sessions) / (binding
   lifetime in seconds)

   For an hypothetical scenario, with 500,000 mobility sessions and with
   binding lifetime of 30 minutes, it results in: 500,000 / 1,800 sec =
   277 transactions/sec

   For the above hypothetical scenario, based on the computation, it is
   apparent that the base Proxy Mobile IPv6 re-registration process
   where the mobile access gateway sends a unique binding refresh
   message for each mobility session is inefficient or sub-optimal.
   These re-registration messages consume significant amount of network
   resources, both in terms of processing power and in terms of network
   bandwidth at both the peers.  Therefore it is the intent of this
   specification to optimize the signaling procedures.  These
   optimizations allow the local mobility anchor and the mobile access
   gateway to perform bulk binding update and revocation operations.

3.2.  General Operation

   The bulk binding update mechanism specified in this document allows
   the mobile access gateway and the local mobility anchor to perform
   binding update and revocation operations on a group of mobility
   sessions.  The group identifier is exchanged and is used as specified
   below.

   A mobile access gateway when sending a Proxy Binding Update message
   can request the local mobility anchor to assign a group identifier
   for the mobile node's mobility session.  This is indicated by setting
   the (B) flag in the Proxy Binding Update.  The local mobility anchor
   upon accepting the request will group the mobility session to a
   specific group and return the group identifier in Proxy Binding
   Acknowledgement message.  It will also set the (B) flag in the Proxy
   Binding Acknowledgement message.  The group identifier is carried in
   the Mobile Node Group Identifier option, described in Section 4.3.

   Once the mobile node's mobility sessions are assigned a group
   identifier, the local mobility anchor and the mobile access gateway
   can use this identifier in the protocol messages for extending the
   scope of the operation to the entire group.  The mobile access
   gateway, for extending the lifetime of all the mobility sessions that
   are part of a group, can send a Proxy Binding Update message with the
   group Identifier in the Mobile Node Group Identifier option.



Abinader, et al.          Expires April 1, 2012                 [Page 5]

Internet-Draft            Bulk Re-registration            September 2011


   Figure 1 explains the operational sequence of the bulk binding update
   and revocation operations between the mobile access gateway and the
   local mobility anchor.


             MAG        LMA
              |          |
    MN1-------|          | 1. MN1 Attached to the link
              |--------->| 2. Proxy Binding Update (MN1)
              |<---------| 3. Proxy Binding Acknowledgement (GroupId X)
   (MN1:GID X)|          |   (BCE for MN1 created, assigned GroupId X)
              |          |
              |          |
    MN2-------|          | 4. MN2 Attached to the link
              |--------->| 5. Proxy Binding Update (MN2)
              |<---------| 6. Proxy Binding Acknowledgement (GroupId=X)
   (MN2 GID X)|          | (BCE for MN2 created, assigned GroupId X)
              |          |
              |--------->| 7. Proxy Binding Update (GroupId=X)
              |<---------| 8. Proxy Binding Acknowledgement
              |          | (Session Lifetimes for MN1, MN2 extended)
              |          |
              |<---------| 9. Binding Revocation Indication (GroupId X)
              |--------->| 10. Binding Revocation Acknowledgement
     MN1, MN2 |          |   (MN1, MN2 sessions revoked at the MAG)
     sessions |          |
     removed  |          |


            Figure 1: Exchange of IP Traffic Offload Selectors


4.  Message formats

   This section identifies the extensions to Proxy Mobile IPv6 signaling
   messages that are required for supporting this specification.















Abinader, et al.          Expires April 1, 2012                 [Page 6]

Internet-Draft            Bulk Re-registration            September 2011


4.1.  Extensions to Proxy Binding Update Message

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |            Sequence #         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |A|H|L|K|M|R|P|F|T|B| Reserved  |            Lifetime           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   .                                                               .
   .                        Mobility options                       .
   .                                                               .
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                                 Figure 2

   A new flag, Bulk-Binding-Update (B) flag is defined in the Proxy
   Binding Update message specified in [RFC5213].  The bit-value of
   Bulk-binding-update (B) flag in the flags field of the message will
   be TBD(0x0040 - subject to IANA approval).

   If the Bulk-Binding-Update flag (B) is set to a value of (1), it
   serves as a request to the local mobility anchor to assign the mobile
   node's mobility session to the Bulk-Binding-Update group.  If the (B)
   flag is set to a value of (0), the local mobility anchor MUST exclude
   the mobile node's mobility session from the bulk binding update group
   and thus any any binding update, or binding revocation operations
   with bulk scope will not be applied to that mobility session.

   All other fields in the Proxy Binding Update message and the mobility
   options that can be carried in the message confirm to the respective
   specifications.

















Abinader, et al.          Expires April 1, 2012                 [Page 7]

Internet-Draft            Bulk Re-registration            September 2011


4.2.  Extensions to Proxy Binding Acknowledgment Message

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |   Status      |K|R|P|T|B| Res.|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |         Sequence #            |           Lifetime            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   .                                                               .
   .                        Mobility options                       .
   .                                                               .
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

              Figure 3: Proxy Binding Acknowledgment Message

   A new flag, Bulk-Binding-Update (B) flag is defined in the Proxy
   Binding Acknowledgment message specified in [RFC5213].  The bit-value
   of Bulk-Binding-Update (B) flag in the flags field of the message is
   TBD (0x01 - subject to IANA approval).

   If the Bulk-Binding-Update flag (B) is set to a value of (1), it
   serves as an indication to the mobile access gateway that the mobile
   node's mobility session was successfully added to the bulk binding
   update group.  The value of the flag MUST be set to the value of (0),
   if the value of the (B) flag in the Proxy Binding Update message that
   it received from the mobile access gateway was set to a value of (0).

   All other fields in the Proxy Binding Acknowledgment message and the
   mobility options that can be carried in the message confirm to the
   respective specifications.

4.3.  Mobile Node Group Identifier Option

   A new option, Mobile Node Group Identifier option is defined for
   using it in Proxy Mobile IPv6 signaling messages exchanged between a
   local mobility anchor and a mobile access gateway.  This option is
   used for carrying the mobile node's group identifier.  There can be
   multiple instances of this option in a given signaling message,
   however, each of the instance SHOULD have a different sub-type.  This
   option is a generic option and this specification uses only the sub-
   type value of (1).  The alignment requirement for this option is 4n.

   The type value for this option is TBD (46 - subject to IANA approval)





Abinader, et al.          Expires April 1, 2012                 [Page 8]

Internet-Draft            Bulk Re-registration            September 2011


   0                   1                   2                   3
   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Type     |   Length      |           Sub-type            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Mobile Node Group Identifier                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

               Figure 4: Mobile Node Group Identifier Option

   Type
      <IANA>

   Length
      8-bit unsigned integer indicating the length in octets of the
      option, excluding the type and length fields.  The value for this
      field MUST be set to a value of (6).

   Sub-type
      Identifies the specific group type.  This number space will be
      managed by the IANA.  The sub-type value of (1) is reserved for
      Bulk binding update group and the sub-type value of (255) is
      reserved for the group, all nodes attached to the mobile access
      gateway that have mobility sessions on a given local mobility
      anchor.

   Mobile Node Group Identifier   A 32-bit field containing the mobile
      node's group identifier.

   The group identifier reflects the group affiliation that is local to
   a specific LMA-MAG pair.

4.4.  Status Codes

   This document defines the following new Status codes values for use
   in the Proxy Binding Acknowledgement message.  These values are to be
   allocated from the same numbering space, as defined in Section 6.1.8
   of [RFC6275].

   INVALID_MOBILE_NODE_GROUP_IDENTIFIER: IANA

      Invalid group identifier value in the request


5.  Protocol Considerations






Abinader, et al.          Expires April 1, 2012                 [Page 9]

Internet-Draft            Bulk Re-registration            September 2011


5.1.  MAG Considerations

   The following considerations MUST be applied by the mobile access
   gateway.

   The conceptual Binding Update List entry data structure maintained by
   the mobile access gateway, described in Section 6.1 of [RFC5213],
   MUST be extended to store the mobile node's group identifier assigned
   for the bulk binding update operations.

   The mobile access gateway SHOULD maintain a global list, which
   identifies the list of bulk binding update groups for each local
   mobility anchor.  Example: LMA-1(G1, G2) LMA-2(G3, G4).

5.1.1.  Requesting a Bulk Binding Update Group Identifier

   The following sections identify the considerations for requesting the
   local mobility anchor to assign a Bulk binding update group
   identifier for the mobility session, so the mobile access gateway can
   use the group identifier when requesting binding update, or
   revocation operations with group specific scope.

   o  When sending a Proxy Binding Update message to the local mobility
      anchor, the mobile access gateway MAY choose to request the local
      mobility anchor to enable bulk binding update support for the
      mobility session associated with that Proxy Binding Update
      request.  When making such request, the bulk binding update flag
      (B) in the request MUST be set to a value of (1).  The decision to
      request the bulk binding update mode for a mobile node is a matter
      of local policy at the mobile access gateway and is controlled by
      the configuration variable,
      RequestBulkBindingUpdateSupportForMobilitySession.

   o  Upon receiving the Proxy Binding Acknowledgment message with
      status code value set to (0) (Proxy Binding Update accepted), the
      bulk binding update flag (B) in the reply is set to a value of (1)
      and if there is a mobile node group identifier option present, the
      message serves as a hint that the local mobility anchor has
      enabled bulk binding update support for the mobility session and
      that the mobile access gateway MAY use the group identifier when
      requesting binding update or binding revocation operation with
      group specific scope.  The group identifier value in Binding
      Update List entry MUST also be updated to include the assigned
      group identifier.

   o  At any point of time, the mobile access gateway chooses to request
      the local mobility anchor to disable bulk binding update support
      for a mobility session, it MUST send a Proxy Binding Update



Abinader, et al.          Expires April 1, 2012                [Page 10]

Internet-Draft            Bulk Re-registration            September 2011


      message with the (B) flag set to a value of (0).  This message is
      sent as a normal re-registration request for lifetime extension,
      including the Mobile Node Identifier option.  Considerations from
      section 6.9.1 [RFC5213] MUST be applied.

5.1.2.  Sending a Bulk Binding Update Operation Request

   The following section identifies the considerations for mobile access
   gateway for performing binding update and revocation operations with
   group specific scope.

   o  For extending the lifetime of all mobility sessions that share the
      same group identifier, the mobile access gateway MAY choose to
      send a Bulk binding update request.  For making such request, it
      can send a Proxy Binding Update message to the local mobility
      anchor, including the Mobile Node Group Identifier option.  The
      identifier value in the option MUST be set to the identifier of
      the group for which bulk binding update operation is being
      requested.  The message MUST NOT include any individual session
      identifiers such as, Mobile Node Identifier option [RFC5213], Home
      Network Prefix option [RFC5213], the IPv4 Home Address Request
      option [RFC5844], or the GRE Key option [RFC5845].  All the
      Considerations from section 5.3.3 [RFC5213] MUST be followed when
      sending this request, with exception related to the use of Mobile
      Node Group Identifier option in place of the individual session
      identifiers.

   o  When requesting binding revocation for all the sessions that share
      the same group identifier, the mobile access gateway MAY choose to
      send a Bulk revocation request.  For making such request, it can
      send a Binding Revocation Indication message to the local mobility
      anchor, including the Mobile Node Group Identifier option.  The
      identifier value in the option MUST be set to the identifier of
      the group for which bulk binding update operation is being
      requested.  The message MUST NOT include any individual session
      identifiers such as, Mobile Node Identifier option [RFC5213], Home
      Network Prefix option [RFC5213], the IPv4 Home Address Request
      option [RFC5844] or the GRE Key option [RFC5845].  All the
      Considerations from section 9.2 [RFC5846] MUST be followed when
      sending this request, with exception related to the use of Mobile
      Node Group Identifier option in place of the individual session
      identifiers.

5.2.  LMA Considerations

   For supporting this specification, the following considerations MUST
   be applied by the local mobility anchor when processing Proxy Mobile
   IPv6 signaling messages.



Abinader, et al.          Expires April 1, 2012                [Page 11]

Internet-Draft            Bulk Re-registration            September 2011


   The conceptual Binding Cache entry data structure maintained by the
   local mobility anchor, described in Section 5.1 of [RFC5213] must be
   extended to store the mobile node's Bulk Re-Registration and
   Revocation group identifier.

5.2.1.  Assigning a Bulk Binding Update Group Identifier

   This section identifies the considerations for local mobility anchor
   for assigning a bulk binding update group identifier to a mobility
   session.

   o  The local mobility anchor will process a received Proxy Binding
      Update message as specified in [RFC5213].  However, if the (B)
      flag in the received Proxy Binding Update message is set to a
      value of (1), or if it includes a Mobile Node Group Identifier
      option, the local mobility anchor applies the following additional
      considerations.

   o  If the (B) flag in the received Proxy Binding Update message is
      set to a value of (1) and if the Mobile Node Group Identifier
      option is not present in the request, the message serves as a
      request to the local mobility anchor to include the mobile node's
      session to the bulk binding update group.  Upon successful
      processing and acceptance of the Proxy Binding Update, the local
      mobility anchor MAY choose to enable bulk binding update support
      for this mobility session by including the mobility session to a
      bulk binding update group.  The decision whether to enable bulk
      binding update support for that mobility session is a matter of
      local policy and is controlled by the configuration variable,
      AcceptBulkBindingUpdateReqMobilitySession.

   o  For enabling the bulk binding update support for the mobility
      session, the local mobility anchor MAY choose to associate the
      mobility session to a specific group.  The specific details on how
      the local mobility anchor associates the given mobility session to
      a specific bulk binding update group is outside the scope of this
      document.  The group identifier field in the Binding Cache entry
      is updated with the identifier of the group to which the mobility
      session is associated.

   o  If the bulk binding update support is enabled for the mobile
      node's mobility session, the local mobility anchor MUST send the
      bulk binding update group identifier as part of the Mobile Node
      Group Identifier option in the Proxy Binding Acknowledgment
      message that it sends to the mobile access gateway.  The (B) flag
      in the Proxy Binding Acknowledgment message MUST be set to value
      of (1).




Abinader, et al.          Expires April 1, 2012                [Page 12]

Internet-Draft            Bulk Re-registration            September 2011


   o  If the bulk binding update support is not enabled for the mobile
      node's mobility session, the local mobility anchor MUST NOT
      include the Mobile Node Group Identifier option with a sub-type
      value of (1) in the Proxy Binding Acknowledgment reply that it
      sends to the mobile access gateway.  Furthermore, the (B) flag in
      the Proxy Binding Acknowledgment message MUST be set to value of
      (0).  It is to be noted that the Mobile Node Group Identifier
      option is a generic option and new sub-types may be defined by
      future specifications.

   o  If the received Proxy Binding Update message is not a bulk binding
      update request, (i.e., the (B) flag is set to a value of (0) and
      the Mobile Node Group Identifier option is not present), but is a
      request for extending the lifetime of an existing mobility session
      which is already part of a bulk binding update group, then the
      local mobility anchor MUST process the request as specified in
      [RFC5213].  However, the value of (0) in the (B) flag in the
      message serves as a request for the local mobility anchor to
      remove the session from performing bulk binding update operations.
      Upon accepting the request, the mobility session MUST be removed
      from the bulk binding update group.  The value of the group
      identifier in the Binding Cache entry must be set to the value of
      (0).

   o  Any time the local mobility anchor detects that the mobile node
      has roamed and changed its point of attachment to a new mobile
      access gateway, it SHOULD also update the group identifier of the
      mobility session.  As part of sending the Proxy Binding
      Acknowledgment to the new mobile access gateway, it MUST include
      the updated group identifier in the Mobile Node Group identifier
      option.  However, if the if the received Proxy Binding Update from
      the new mobile access gateway did not have the (B) flag set to a
      value of (1), then it MUST NOT include the mobility session in any
      of bulk binding update group and MUST NOT include the Mobile Node
      Group identifier option with the sub-type value of (1).

   o  Any time a mobile node's mobility session is de-registered by the
      mobile access gateway, or the session is revoked for
      administrative or any other reasons, the mobility session MUST
      also be removed from the bulk binding update group.

5.2.2.  Handling a Bulk Binding Update Request

   The following are the considerations related to handling bulk binding
   update request.






Abinader, et al.          Expires April 1, 2012                [Page 13]

Internet-Draft            Bulk Re-registration            September 2011


   o  Any time the local mobility anchor receives a Proxy Binding Update
      message with a Mobile Node Group Identifier option present in the
      request and with sub-type value of (1) (bulk binding update
      group), the local mobility anchor MUST consider the request as a
      bulk binding update request, with the request scope for extending
      the lifetime of all the mobility sessions that share the same
      group identifier present in the Mobile Node Group Identifier
      option.  However, if the received request also includes any
      individual session identifiers such as, Mobile Node Identifier
      option [RFC5213], Home Network Prefix option [RFC5213], the IPv4
      Home Address Request option [RFC5844], or the GRE Key option
      [RFC5845] the local mobility anchor MUST consider this as an
      invalid message; it MUST reject the Proxy Binding Update message
      and send a Proxy Binding Acknowledgement message with the Status
      field set to INVALID_MOBILE_NODE_GROUP_IDENTIFIER (Invalid group
      identifier value in the request).

   o  The local mobility anchor MUST consider the message as a request
      for extending the lifetime of all the mobility sessions that are
      associated to each of group identifier from the Mobile Node Group
      Identifier option.  There can be multiple instances of the Mobile
      Node Group Identifier option present in the request.  However, the
      group identifier value in each of these options MUST be different.
      Currently, this specification only support sub-type value of (1).
      If this requirement is not met, the local mobility anchor MUST
      reject the Proxy Binding Update message and send a Proxy Binding
      Acknowledgement message with the Status field set to
      INVALID_MOBILE_NODE_GROUP_IDENTIFIER (Invalid group identifier
      value in the request).

   o  Upon accepting the bulk binding update request, the local mobility
      anchor SHOULD extend the lifetime for all the mobility sessions
      that are part of bulk binding update group identified by the group
      identifier in the Mobile Node Group Identifier in the message.
      Considerations from [RFC5213] MUST be applied for extending the
      lifetime of a mobile node's session.  It MUST also send a Proxy
      Binding Acknowledgment message with the Status field value set to
      0 (Proxy Binding Update accepted).  The lifetime field in the
      message MUST be set to the allocated lifetime for all the mobility
      sessions.  The message MUST also include the Mobile Node Group
      Identifier option, with the identifier value copied from the
      Mobile Node Group Identifier option present in the received Proxy
      Binding Update message.

   o  If the local mobility anchor rejects the bulk binding update
      request for any administrative reason, then it MUST NOT update the
      lifetime in the binding cache entries of any of the mobile nodes
      identified by the group identifier.  The local mobility anchor



Abinader, et al.          Expires April 1, 2012                [Page 14]

Internet-Draft            Bulk Re-registration            September 2011


      SHOULD send a Proxy Binding Acknowledgment indicating the reason
      for the rejection in the status code.

   o  Any time the local mobility anchor receives a Binding Revocation
      Indication Message [RFC5846], with a Mobile Node Group Identifier
      option present in the request and with sub-type value of (1) (bulk
      binding update group), the local mobility anchor MUST consider the
      request as a bulk revocation request, with the request scope for
      revoking of all the mobility sessions that share the same group
      identifier present in the Mobile Node Group Identifier option.
      However, if the received request also includes a Mobile Node
      Identifier option [RFC5213], Home Network Prefix option [RFC5213],
      the IPv4 Home Address Request option [RFC5844], or the GRE Key
      Option [RFC5845], the local mobility anchor MUST consider this as
      an invalid message; it MUST reject the Binding Revocation
      Indication message and send a Binding Revocation Acknowledgement
      message with the Status field set to a value of 128 (Binding Does
      NOT Exist).  All the considerations from [RFC5846] apply when
      processing binding revocation request, except making the scope of
      the operation apply to a set of mobility sessions identified by
      the group identifier present in the request.

   o  Upon accepting the Binding Revocation Indication request and
      completing the operation, the local mobility anchor MUST send a
      Binding Revocation Acknowledgement message with the Status field
      set to a value of 0 (success).  The message MUST include the
      Mobile Node Group Identifier option, with the identifier value
      copied from the Mobile Node Group Identifier option present in the
      received Binding Revocation Indication message.


6.  Protocol Configuration Variables

6.1.  Local Mobility Anchor - Configuration Variables

   The local mobility anchor MUST allow the following variables to be
   configured by the system management.  The configured values for these
   protocol variables MUST survive server reboots and service restarts.

   AcceptBulkBindingUpdateReqMobilitySession

      This flag indicates whether or not the local mobility anchor
      should accept the request from the mobile access gateway to enable
      bulk binding update support for the mobility session.  The default
      value for this flag is set to (1), indicating that it SHOULD
      accept the request from the mobile access gateway.  If the value
      of the flag is set to (0), the local mobility anchor MUST deny the
      request.



Abinader, et al.          Expires April 1, 2012                [Page 15]

Internet-Draft            Bulk Re-registration            September 2011


6.2.  Mobile Access Gateway - Configuration Variables

   The mobile access gateway MUST allow the following variables to be
   configured by the system management.  The configured values for these
   protocol variables MUST survive server reboots and service restarts.

   RequestBulkBindingUpdateSupportForMobilitySession

      This flag indicates whether or not the mobile access gateway
      should request the local mobility anchor to enable bulk binding
      update support for the mobility session.  The default value for
      this flag is set to (1), indicating that the the mobile access
      gateway MUST set the bulk binding update flag (B) in the Proxy
      Binding Update request to a value of (1).  If the flag is set to a
      value of (0), the mobile access gateway MUST set the bulk binding
      update flag (B) in the Proxy Binding Update to a value of (0).


7.  IANA Considerations

   This document requires the following five IANA actions.

   o  Action-1: This specification defines a new flag (B) to the Proxy
      Binding Update message, specified in [RFC5213].  This flag is
      described in Section 4.1.  The value of the flag (B) needs to be
      allocated from the Binding Update Flags registry.

   o  Action-2: This specification defines a new flag (B) to the Proxy
      Binding Acknowledgment message, specified in [RFC5213].  This flag
      is described in Section 4.2.  The value of the flag (B) needs to
      be allocated from the Binding Acknowledgment Flags registry.

   o  Action-3: This specification defines a new Mobility Header option,
      the Mobile Node Group Identifier option.  This option is described
      in Section 4.3.  The Type value for this option needs to be
      assigned from the same numbering space as allocated for the other
      mobility options [RFC6275].

   o  Action-4: The Sub-type field of the Mobile Node Group Identifier
      option introduces a new number space.  This number space needs to
      be managed by IANA, under the Registry, Mobile Node Group
      Identifier Type Registry.  This specification reserves the sub-
      type value of (1) and (255).  Approval of new sub-type values are
      to be made through IANA Expert Review.

   o  Action-5: This document also defines a new status value, for use
      in Proxy Binding Acknowledgement message, as described in
      Section 4.4.  This value is to be assigned from the same number



Abinader, et al.          Expires April 1, 2012                [Page 16]

Internet-Draft            Bulk Re-registration            September 2011


      space as allocated for other Status codes [RFC6275].  The
      allocated value has to be greater than 128.

   INVALID_MOBILE_NODE_GROUP_IDENTIFIER

   o  Invalid group identifier value in the request: IANA


8.  Security Considerations

   The Mobile Node Group Identifier option defined in this specification
   is for use in Proxy Binding Update and Proxy Binding Acknowledgement
   messages.  This option is carried like any other mobility header
   option and it does not require any other special security
   considerations.

   The bulk binding update and the bulk revocation operations specified
   in this document, do not introduce any new security threat or
   vulnerability to the Proxy Mobile IPv6 protocol security.


9.  Acknowledgements

   The authors would like to specially thank Jouni Korhonen, Basavaraj
   Patil and Carlos Jesus Bernardos Cano for their reviews and inputs to
   this document.


10.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC5213]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K.,
              and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

   [RFC5844]  Wakikawa, R. and S. Gundavelli, "IPv4 Support for Proxy
              Mobile IPv6", RFC 5844, May 2010.

   [RFC5845]  Muhanna, A., Khalil, M., Gundavelli, S., and K. Leung,
              "Generic Routing Encapsulation (GRE) Key Option for Proxy
              Mobile IPv6", RFC 5845, June 2010.

   [RFC5846]  Muhanna, A., Khalil, M., Gundavelli, S., Chowdhury, K.,
              and P. Yegani, "Binding Revocation for IPv6 Mobility",
              RFC 5846, June 2010.

   [RFC6275]  Perkins, C., Johnson, D., and J. Arkko, "Mobility Support



Abinader, et al.          Expires April 1, 2012                [Page 17]

Internet-Draft            Bulk Re-registration            September 2011


              in IPv6", RFC 6275, July 2011.


Authors' Addresses

   Fuad Abinader (editor)
   Instituto Nokia de Tecnologia
   Av. Torquato Tapajos, 7200 - Km. 12 - Col Terra Nova
   Manaus, AM  69048-660
   BRAZIL

   Email: fuad.junior@indt.org.br


   Sri Gundavelli (editor)
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Phone:
   Fax:
   Email: sgundave@cisco.com
   URI:


   Kent Leung
   Cisco
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Phone:
   Fax:
   Email: kleung@cisco.com
   URI:















Abinader, et al.          Expires April 1, 2012                [Page 18]

Internet-Draft            Bulk Re-registration            September 2011


   Suresh Krishnan
   Ericsson
   8400 Decarie Blvd.
   Town of Mount Royal, QC
   Canada

   Phone: +1 514 345 7900 x42871
   Fax:
   Email: suresh.krishnan@ericsson.com
   URI:


   Domagoj Premec
   Unaffiliated


   Email: domagoj.premec@gmail.com


































Abinader, et al.          Expires April 1, 2012                [Page 19]

